In [1]:
import pandas as pd
import numpy as np

### DataFrame.combine(other, func, fill_value=None, overwrite=True)

### eg1

In [89]:
df1 = pd.DataFrame({'A': [0, 0], 'B': [4, 4]})
df2 = pd.DataFrame({'A': [1, 1], 'B': [3, 3]})

In [90]:
df1

   A  B
0  0  4
1  0  4

In [91]:
df2

   A  B
0  1  3
1  1  3

In [31]:
take_smaller = lambda s1, s2: s1 if s1.sum() < s2.sum() else s2
df1.combine(df2, take_smaller)

   A  B
0  0  3
1  0  3

### eg2

In [92]:
df1 = pd.DataFrame({'A': [5, 0], 'B': [2, 4]})
df2 = pd.DataFrame({'A': [1, 1], 'B': [3, 3]})

In [93]:
df1

   A  B
0  5  2
1  0  4

In [94]:
df2

   A  B
0  1  3
1  1  3

In [96]:
df1.combine(df2, np.minimum)

   A  B
0  1  2
1  0  3

### eg3

In [77]:
df1 = pd.DataFrame({'A': [0, 0], 'B': [None, 4]})
df2 = pd.DataFrame({'A': [1, 1], 'B': [3, 3]})

In [78]:
df1

   A    B
0  0  NaN
1  0  4.0

In [79]:
df2

   A  B
0  1  3
1  1  3

In [80]:
take_smaller = lambda s1, s2: s1 if s1.sum() < s2.sum() else s2
df1.combine(df2, take_smaller, fill_value=-5)

   A    B
0  0 -5.0
1  0  4.0

### eg4

In [68]:
df1 = pd.DataFrame({'A': [0, 0], 'B': [None, 4]})
df2 = pd.DataFrame({'A': [1, 1], 'B': [None, 3]})
df1

   A    B
0  0  NaN
1  0  4.0

In [53]:
df2

   A    B
0  1  NaN
1  1  3.0

In [44]:
df1.combine(df2, take_smaller, fill_value=-5)

   A    B
0  0 -5.0
1  0  3.0

### eg5

In [81]:
df1 = pd.DataFrame({'A': [0, 0], 'B': [4, 4]})
df2 = pd.DataFrame({'B': [3, 3], 'C': [-10, 1], }, index=[1, 2])
df1

   A  B
0  0  4
1  0  4

In [82]:
df2

   B   C
1  3 -10
2  3   1

In [57]:
df1.combine(df2, take_smaller)

    A    B     C
0 NaN  NaN   NaN
1 NaN  3.0 -10.0
2 NaN  3.0   1.0

In [58]:
df1.combine(df2, take_smaller, overwrite=False)

     A    B     C
0  0.0  NaN   NaN
1  0.0  3.0 -10.0
2  NaN  3.0   1.0

### eg6

In [86]:
df1

   A  B
0  0  4
1  0  4

In [87]:
df2 = pd.DataFrame({'B': [3, 3], 'C': [1, 1], }, index=[1, 2])
df2

   B  C
1  3  1
2  3  1

In [88]:
df2.combine(df1, take_smaller)

     A    B   C
0  0.0  NaN NaN
1  0.0  3.0 NaN
2  NaN  3.0 NaN

In [51]:
df2.combine(df1, take_smaller, overwrite=False)

     A    B    C
0  0.0  NaN  NaN
1  0.0  3.0  1.0
2  NaN  3.0  1.0